	.xdef   ZigzagL,Zigzag,Zigzag_Y
	.xdef	temp_name,temp_file
	.xdef   ParamMsg
	.xdef	msg1,msg2,msg3,msg4,msg5,msg6
	.xdef	jmsg1,jmsg2,jmsg3
	.xdef	EOI,SOI,APP,COM,COM0,DQT,QtableL0,QtableC0,DHT,SOF,SOS,SOS_mono
	.xdef	running_size
  .text

.xdef	work_adrs,COS_TBL_adrs,int4c_bak,mouse_sub_bak
work_adrs	ds.l	1
COS_TBL_adrs	ds.l	1
int4c_bak	ds.l	1
mouse_sub_bak	ds.l	1

ZigzagL
  dc.w    (0*8+1-0*8-0)*2	1
  dc.w	  (1*8+0-0*8-1)*2	2
  dc.w	  (2*8+0-1*8-0)*2	3
  dc.w    (1*8+1-2*8-0)*2	4
  dc.w    (0*8+2-1*8-1)*2	5
  dc.w    (0*8+3-0*8-2)*2	6
  dc.w    (1*8+2-003)*2		7

  dc.w    (2*8+1-010)*2		8
  dc.w    (3*8+0-017)*2		9
  dc.w    (4*8+0-024)*2		10
  dc.w    (3*8+1-032)*2		11
  dc.w    (2*8+2-025)*2		12
  dc.w    (1*8+3-018)*2		13
  dc.w    (0*8+4-011)*2		14
  dc.w    (0*8+5-004)*2		15

  dc.w    (1*8+4-005)*2		16
  dc.w    (2*8+3-012)*2		17
  dc.w    (3*8+2-019)*2		18
  dc.w    (4*8+1-026)*2		19
  dc.w    (5*8+0-033)*2		20
  dc.w    (6*8+0-040)*2		21
  dc.w    (5*8+1-048)*2		22
  dc.w    (4*8+2-041)*2		23

  dc.w    (3*8+3-034)*2		24
  dc.w    (2*8+4-027)*2		25
  dc.w    (1*8+5-020)*2		26
  dc.w    (0*8+6-013)*2		27
  dc.w    (0*8+7-006)*2		28
  dc.w    (1*8+6-007)*2		29
  dc.w    (2*8+5-014)*2		30
  dc.w    (3*8+4-021)*2		31

  dc.w    (4*8+3-028)*2		32
  dc.w    (5*8+2-035)*2		33
  dc.w    (6*8+1-042)*2		34
  dc.w    (7*8+0-049)*2		35
  dc.w    (7*8+1-056)*2		36
  dc.w    (6*8+2-057)*2		37
  dc.w    (5*8+3-050)*2		38
  dc.w    (4*8+4-043)*2		39

  dc.w    (3*8+5-036)*2		40
  dc.w    (2*8+6-029)*2		41
  dc.w    (1*8+7-022)*2		42
  dc.w    (2*8+7-015)*2		43
  dc.w    (3*8+6-023)*2		44
  dc.w    (4*8+5-030)*2		45
  dc.w    (5*8+4-037)*2		46
  dc.w    (6*8+3-044)*2		47

  dc.w    (7*8+2-051)*2		48
  dc.w    (7*8+3-058)*2		49
  dc.w    (6*8+4-059)*2		50
  dc.w    (5*8+5-052)*2		51
  dc.w    (4*8+6-045)*2		52
  dc.w    (3*8+7-038)*2		53
  dc.w    (4*8+7-031)*2		54
  dc.w    (5*8+6-039)*2		55

  dc.w    (6*8+5-046)*2		56
  dc.w    (7*8+4-053)*2		57
  dc.w    (7*8+5-060)*2		58
  dc.w    (6*8+6-061)*2		59
  dc.w    (5*8+7-054)*2		60
  dc.w    (6*8+7-047)*2		61
  dc.w    (7*8+6-055)*2		62
  dc.w    (7*8+7-062)*2		63
*
* 　ジグザグスキャンの順序（本来）
*  　　　０　    １  　  ５　    ６　  １４　  １５　  ２７  　２８
*  　　　２　    ４　    ７　  １３　  １６　  ２６　  ２９　  ４２
*  　　　３    　８  　１２　  １７　  ２５　  ３０　  ４１　  ４３
*　　　　９　  １１  　１８    ２４  　３１  　４０  　４４  　５３
*　　　１０　  １９　  ２３　  ３２　  ３９　  ４５　  ５２　  ５４
*　　　２０　  ２２　  ３３　  ３８　  ４６　  ５１　  ５５　  ６０
*　　　２１　  ３４　  ３７　  ４７　  ５０　  ５６　  ５９　  ６１
*　　　２５　  ２６　  ４６　  ４９　  ５７　  ５８  　６２　  ６３
*
* 　IDCTでﾒﾓﾘからﾃﾞｰﾀをmovemで読み込めるようにするために
*
*　ＵＶ成分では
*
*	　上の表の縦の並び
*	　　0 1 2 3 4 5 6 7
*		　　を
*	    4 0 1 2 3 5 6 7
*	　に
*	　横の並び
*	    0 1 2 3 4 5 6 7
*	　　　　　 を
*	　　4 0 1 2 3 5 6 7
*		   を逆にして
*	    7 6 5 3 2 1 0 4
*	　に
*	　そして縦と横を入れ換えてﾒﾓﾘに格納する
*
*　Ｙ成分では
*
*	　上の表の縦の並び
*	　　0 1 2 3 4 5 6 7
*		　　を
*	    4 0 1 2 3 5 6 7
*	　に
*	　横の並び
*	　　0 1 2 3 4 5 6 7
*		　　を
*	    0 4 1 2 3 5 6 7
*		   を逆にして
*	    7 6 5 3 2 1 4 0
*	　に
*	　そして縦と横を入れ換えてﾒﾓﾘに格納する
*
*ＵＶ成分の逆ジグザグテーブル
*----------------------
Zigzag
  dc.w	5*16+1*2-6*16-1*2
  dc.w	6*16+2*2-5*16-1*2
  dc.w	6*16+3*2-6*16-2*2
  dc.w	5*16+2*2-6*16-3*2
  dc.w	4*16+1*2-5*16-2*2
  dc.w	3*16+1*2-4*16-1*2
  dc.w	4*16+2*2-3*16-1*2
  dc.w	5*16+3*2-4*16-2*2
  dc.w	6*16+4*2-5*16-3*2
  dc.w	6*16+0*2-6*16-4*2
  dc.w	5*16+4*2-6*16-0*2
  dc.w	4*16+3*2-5*16-4*2
  dc.w	3*16+2*2-4*16-3*2
  dc.w	7*16+1*2-3*16-2*2
  dc.w	2*16+1*2-7*16-1*2
  dc.w	7*16+2*2-2*16-1*2
  dc.w	3*16+3*2-7*16-2*2
  dc.w	4*16+4*2-3*16-3*2
  dc.w	5*16+0*2-4*16-4*2
  dc.w	6*16+5*2-5*16-0*2
  dc.w	6*16+6*2-6*16-5*2
  dc.w	5*16+5*2-6*16-6*2
  dc.w	4*16+0*2-5*16-5*2
  dc.w	3*16+4*2-4*16-0*2
  dc.w	7*16+3*2-3*16-4*2
  dc.w	2*16+2*2-7*16-3*2
  dc.w	1*16+1*2-2*16-2*2
  dc.w	0*16+1*2-1*16-1*2
  dc.w	1*16+2*2-0*16-1*2
  dc.w	2*16+3*2-1*16-2*2
  dc.w	7*16+4*2-2*16-3*2
  dc.w	3*16+0*2-7*16-4*2
  dc.w	4*16+5*2-3*16-0*2
  dc.w	5*16+6*2-4*16-5*2
  dc.w	6*16+7*2-5*16-6*2
  dc.w	5*16+7*2-6*16-7*2
  dc.w	4*16+6*2-5*16-7*2
  dc.w	3*16+5*2-4*16-6*2
  dc.w	7*16+0*2-3*16-5*2
  dc.w	2*16+4*2-7*16-0*2
  dc.w	1*16+3*2-2*16-4*2
  dc.w	0*16+2*2-1*16-3*2
  dc.w	0*16+3*2-0*16-2*2
  dc.w	1*16+4*2-0*16-3*2
  dc.w	2*16+0*2-1*16-4*2
  dc.w	7*16+5*2-2*16-0*2
  dc.w	3*16+6*2-7*16-5*2
  dc.w	4*16+7*2-3*16-6*2
  dc.w	3*16+7*2-4*16-7*2
  dc.w	7*16+6*2-3*16-7*2
  dc.w	2*16+5*2-7*16-6*2
  dc.w	1*16+0*2-2*16-5*2
  dc.w	0*16+4*2-1*16-0*2
  dc.w	0*16+0*2-0*16-4*2
  dc.w	1*16+5*2-0*16-0*2
  dc.w	2*16+6*2-1*16-5*2
  dc.w	7*16+7*2-2*16-6*2
  dc.w	2*16+7*2-7*16-7*2
  dc.w	1*16+6*2-2*16-7*2
  dc.w	0*16+5*2-1*16-6*2
  dc.w	0*16+6*2-0*16-5*2
  dc.w	1*16+7*2-0*16-6*2
  dc.w	0*16+7*2-1*16-7*2

*Ｙ成分の逆ジグザグテーブル
*----------------------
Zigzag_Y
  dc.w	5*16+1*2-7*16-1*2
  dc.w	7*16+2*2-5*16-1*2
  dc.w	7*16+3*2-7*16-2*2
  dc.w	5*16+2*2-7*16-3*2
  dc.w	4*16+1*2-5*16-2*2
  dc.w	3*16+1*2-4*16-1*2
  dc.w	4*16+2*2-3*16-1*2
  dc.w	5*16+3*2-4*16-2*2
  dc.w	7*16+4*2-5*16-3*2
  dc.w	7*16+0*2-7*16-4*2
  dc.w	5*16+4*2-7*16-0*2
  dc.w	4*16+3*2-5*16-4*2
  dc.w	3*16+2*2-4*16-3*2
  dc.w	6*16+1*2-3*16-2*2
  dc.w	2*16+1*2-6*16-1*2
  dc.w	6*16+2*2-2*16-1*2
  dc.w	3*16+3*2-6*16-2*2
  dc.w	4*16+4*2-3*16-3*2
  dc.w	5*16+0*2-4*16-4*2
  dc.w	7*16+5*2-5*16-0*2
  dc.w	7*16+6*2-7*16-5*2
  dc.w	5*16+5*2-7*16-6*2
  dc.w	4*16+0*2-5*16-5*2
  dc.w	3*16+4*2-4*16-0*2
  dc.w	6*16+3*2-3*16-4*2
  dc.w	2*16+2*2-6*16-3*2
  dc.w	1*16+1*2-2*16-2*2
  dc.w	0*16+1*2-1*16-1*2
  dc.w	1*16+2*2-0*16-1*2
  dc.w	2*16+3*2-1*16-2*2
  dc.w	6*16+4*2-2*16-3*2
  dc.w	3*16+0*2-6*16-4*2
  dc.w	4*16+5*2-3*16-0*2
  dc.w	5*16+6*2-4*16-5*2
  dc.w	7*16+7*2-5*16-6*2
  dc.w	5*16+7*2-7*16-7*2
  dc.w	4*16+6*2-5*16-7*2
  dc.w	3*16+5*2-4*16-6*2
  dc.w	6*16+0*2-3*16-5*2
  dc.w	2*16+4*2-6*16-0*2
  dc.w	1*16+3*2-2*16-4*2
  dc.w	0*16+2*2-1*16-3*2
  dc.w	0*16+3*2-0*16-2*2
  dc.w	1*16+4*2-0*16-3*2
  dc.w	2*16+0*2-1*16-4*2
  dc.w	6*16+5*2-2*16-0*2
  dc.w	3*16+6*2-6*16-5*2
  dc.w	4*16+7*2-3*16-6*2
  dc.w	3*16+7*2-4*16-7*2
  dc.w	6*16+6*2-3*16-7*2
  dc.w	2*16+5*2-6*16-6*2
  dc.w	1*16+0*2-2*16-5*2
  dc.w	0*16+4*2-1*16-0*2
  dc.w	0*16+0*2-0*16-4*2
  dc.w	1*16+5*2-0*16-0*2
  dc.w	2*16+6*2-1*16-5*2
  dc.w	6*16+7*2-2*16-6*2
  dc.w	2*16+7*2-6*16-7*2
  dc.w	1*16+6*2-2*16-7*2
  dc.w	0*16+5*2-1*16-6*2
  dc.w	0*16+6*2-0*16-5*2
  dc.w	1*16+7*2-0*16-6*2
  dc.w	0*16+7*2-1*16-7*2
*

*
  even
EOI dc.w $FFD9

SOI dc.w $FFD8
APP dc.w $FFE0,16
    dc.b  'JFIF',0,1,0,0
    dc.w  3,2   * 密度
    dc.w  0
*
COM 
  dc.w  $FFFE,COM0_end-$
COM0
  dc.b  'JPEGED.R v1.26 org.by 砺波盛里 mod.by 藤原尚伸'
COM0_end
*
  even
DQT  dc.w  $FFDB,Qtable_end-(DQT+2)	*132

  dc.b 0
QtableL0
  dc.b  16,11,12,14,12,10,16,14,13,14,18,17,16,19,24,40
  dc.b  26,24,22,22,24,49,35,37,29,40,58,51,61,60,57,51
  dc.b  56,55,64,72,92,78,64,68,87,69,55,56,80,109,81,87
  dc.b  95,98,103,104,103,62,77,113,121,112,100,120,92,101,103,99

  dc.b  1
QtableC0
  dc.b  17,18,18,24,21,24,47,26,26,47,99,66,56,66,99,99
  dc.b  99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99
  dc.b  99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99
  dc.b  99,99,99,99,99,99,99,99,99,99,99,99,99,99,99,99
Qtable_end
*
  even
DHT  dc.w  $FFC4,DHT_end-(DHT+2)	*$01AC

.xdef DHTDCL
DHTDCL
*  dc.b  $00,0,1,5,1,1,1,1,1,1,1,1,1,1,1,0,0
*  dc.b  0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16
	dc.b	$00,0,1,5,1,1,1,1,2,0,0,0,0,0,0,0,0
	dc.b	0
	dc.b	1,2,3,4,5
	dc.b	6
	dc.b	7
	dc.b	8
	dc.b	9
	dc.b	10,11

.xdef DHTACL
DHTACL
  dc.b  $10,0,2,1,3,3,2,4,3,5,5,4,4,0,0,1,$7D
  dc.b  $01,$02,$03,$00,$04,$11,$05,$12
  dc.b  $21,$31,$41,$06,$13,$51,$61,$07
  dc.b  $22,$71,$14,$32,$81,$91,$A1,$08
  dc.b  $23,$42,$B1,$C1,$15,$52,$D1,$F0
  dc.b  $24,$33,$62,$72,$82,$09,$0A
  dc.b  $16,$17,$18,$19,$1A
  dc.b  $25,$26,$27,$28,$29,$2A
  dc.b  $34,$35,$36,$37,$38,$39,$3A
  dc.b  $43,$44,$45,$46,$47,$48,$49,$4A
  dc.b  $53,$54,$55,$56,$57,$58,$59,$5A
  dc.b  $63,$64,$65,$66,$67,$68,$69,$6A
  dc.b  $73,$74,$75,$76,$77,$78,$79,$7A
  dc.b  $83,$84,$85,$86,$87,$88,$89,$8A
  dc.b  $92,$93,$94,$95,$96,$97,$98,$99,$9A
  dc.b  $A2,$A3,$A4,$A5,$A6,$A7,$A8,$A9,$AA
  dc.b  $B2,$B3,$B4,$B5,$B6,$B7,$B8,$B9,$BA
  dc.b  $C2,$C3,$C4,$C5,$C6,$C7,$C8,$C9,$CA
  dc.b  $D2,$D3,$D4,$D5,$D6,$D7,$D8,$D9,$DA
  dc.b  $E1,$E2,$E3,$E4,$E5,$E6,$E7,$E8,$E9,$EA
  dc.b  $F1,$F2,$F3,$F4,$F5,$F6,$F7,$F8,$F9,$FA
 
.xdef DHTDCC
DHTDCC
*  dc.b  $01,0,3,1,1,1,1,1,1,1,1,1,1,1,1,1,1
*  dc.b  0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16
  dc.b  $01,0,3,1,1,1,1,1,1,1,2,0,0,0,0,0,0
	dc.b	0,1,2
	dc.b	3
	dc.b	4
	dc.b	5
	dc.b	6
	dc.b	7
	dc.b	8
	dc.b	9
	dc.b	10,11
 
.xdef DHTACC
DHTACC
  dc.b  $11,0,2,1,2,4,4,3,4,7,5,4,4,0,1,2,$77
					    *bit tbl  値の範囲
					    *1   0    なし  0
	dc.b	$00,$01			    *2   2    0-2   00                 -01 
	dc.b	$02			    *3   1    3     100                -100 
	dc.b	$03,$11			    *4   2    4-5   1010               -1011 
	dc.b	$04,$05,$21,$31		    *5   4    6-9   1100 0             -1101 1
	dc.b	$06,$12,$41,$51		    *6   4    10-13 1110 00            -1110 11
	dc.b	$07,$61,$71		    *7   3    14-16 1111 000           -1110 10
	dc.b	$13,$22,$32,$81		    *8   4    17-20 1111 0110          -1111 1001
	dc.b	$08,$14,$42,$91,$A1,$B1,$C1 *9   7    21-27 1111 1010 0        -1111 1101 0
	dc.b	$09,$23,$33,$52,$F0	    *a   5    28-34 1111 1101 10       -1111 1110 10
	dc.b	$15,$62,$72,$D1		    *b   4    35-38 1111 1110 110      -1111 1111 001
	dc.b	$0A,$16,$24,$34		    *c   4    39-42 1111 1111 0100     -1111 1111 0111
					    *d   0    なし  1111 1111 1000 0
	dc.b	$E1			    *e   1    43    1111 1111 1000 00  -1111 1111 1000 00
	dc.b	$25,$F1			    *f   2    44-45 1111 1111 1000 010 -1111 1111 1000 011
					    *16	$77  46-164 1111 1111 1000 1000-1111 1111 1111 1110
	dc.b	$17,$18,$19,$1A,$26,$27,$28,$29,$2A,$35,$36,$37,$38,$39,$3A,$43
	dc.b	$44,$45,$46,$47,$48,$49,$4A,$53,$54,$55,$56,$57,$58,$59,$5A,$63
	dc.b	$64,$65,$66,$67,$68,$69,$6A,$73,$74,$75,$76,$77,$78,$79,$7A,$82
	dc.b	$83,$84,$85,$86,$87,$88,$89,$8A,$92,$93,$94,$95,$96,$97,$98,$99
	dc.b	$9A,$A2,$A3,$A4,$A5,$A6,$A7,$A8,$A9,$AA,$B2,$B3,$B4,$B5,$B6,$B7
	dc.b	$B8,$B9,$BA,$C2,$C3,$C4,$C5,$C6,$C7,$C8,$C9,$CA,$D2,$D3,$D4,$D5
	dc.b	$D6,$D7,$D8,$D9,$DA,$E2,$E3,$E4,$E5,$E6,$E7,$E8,$E9,$EA,$F2,$F3
	dc.b	$F4,$F5,$F6,$F7,$F8,$F9,$FA
DHT_end
  dc.b  $FF * dummy
*
SOF dc.b  $FF,$C0      *  フレームヘッダー($FFC0)
    dc.b   $00,$11      *  サイズ　($0011)
    dc.b   $08          *  精度    ($08)
    dc.b   0,0          *  垂直ライン数　２バイト
    dc.b   0,0          *  水平ライン数　２バイト
    dc.b    3           *  コンポーネント数($03)
    dc.b   'Y',$11,0    * テーブル識別子,コンポーネント識別子
    dc.b   'U',$11,1    * テーブル識別子,コンポーネント識別子
    dc.b   'V',$11,1    * テーブル識別子,コンポーネント識別子
*     
SOS dc.b  $FF,$DA       *  スキャン開始
    dc.w   $000C        *  サイズ  
    dc.b   3            *  コンポーネント数
    dc.b   'Y',0        *  
    dc.b   'U',$11      *  
    dc.b   'V',$11      *  
    dc.b   $00,$3F,$00  *

SOS_mono dc.b  $FF,$DA  *  スキャン開始
    dc.w   $0008        *  サイズ  
    dc.b   1            *  コンポーネント数
    dc.b   'Y',0        *  
    dc.b   $00,$3F,$00  *

temp_name	dc.b 'temp',0
temp_file	dc.b '\JPEG????.$$$',0

.xdef	msgCR
msgCR	   dc.b $0D,$0A,0
.xdef	msgBar
msgBar	dc.b	'─',0
.xdef	color_msg
.xdef	mono_msg
color_msg	dc.b	'ｶﾗｰ(24bit)',0
mono_msg	dc.b	'ﾓﾉｸﾛ(8bit)',0
.xdef DecodeNowMsg
.xdef DecodeNormalMsg
.xdef DecodeErrorMsg
DecodeNowMsg	dc.b	'展開中',0
DecodeNormalMsg	dc.b	'正常',0
DecodeErrorMsg	dc.b	'ﾌｧｲﾙ異常',0

.xdef	Write_error_msg,Comment_msg,Qtable_msg,file_msg,not_found_msg
.xdef	Read_error_msg
.xdef	not_JPEG_msg
.xdef	cant_PROC_msg
.xdef	out_of_memory_msg
.xdef	illegal_size_msg
.xdef	no_picture_msg
*.xdef	no_sup_24_msg
Write_error_msg	dc.b	'ﾌｧｲﾙ書込ｴﾗｰ',0
Read_error_msg	dc.b	'ﾌｧｲﾙ読込ｴﾗｰ',0
Comment_msg	dc.b	"ｺﾒﾝﾄ",0
Qtable_msg	dc.b	"量子化ﾃｰﾌﾞﾙ",0
file_msg	dc.b	"ﾌｧｲﾙ'",0
not_found_msg	dc.b	"'が見つからない",0
not_JPEG_msg	dc.b	'JPEGﾌｧｲﾙと解釈出来ません',0
cant_PROC_msg	dc.b	'現ﾊﾞｰｼﾞｮﾝでは処理できないﾌｧｲﾙです',0
out_of_memory_msg	dc.b	'ﾒﾓﾘ不足です',0
illegal_size_msg	dc.b	'画面ｻｲｽﾞを超えています',0
no_picture_msg	dc.b	'画像ﾃﾞｰﾀが含まれてません',0
*no_sup_24_msg	dc.b	'24bit展開は未ｻﾎﾟｰﾄ',0
*
* SOF0
*
.xdef BaselineMsg
.xdef ProgressiveMsg
.xdef DCTMsg
BaselineMsg	dc.b	'Baseline ',0
ProgressiveMsg	dc.b	'Progressive ',0
DCTMsg		dc.b	'DCT',0

msg1   dc.b  $0D,$0A,'	画像精度	',0
msg2   dc.b  $0D,$0A,'	ｺﾝﾎﾟｰﾈﾝﾄ	',0
msg3   dc.b  $0D,$0A,'	画像ｻｲｽﾞ	',0
msg4   dc.b  '×',0
msg5   dc.b  $0D,$0A,'	色成分間引率	',0
msg6   dc.b  ':',0
*
*  JFIF
*
jmsg1   dc.b  $0D,$0A,'JFIF',0
jmsg2   dc.b  $0D,$0A,'	水平密度	',0
jmsg3   dc.b  $0D,$0A,'	垂直密度	',0
*
.xdef Info_msg
Info_msg	dc.b	'ﾌｧｲﾙ名',13,10
		dc.b	'画像ｻｲｽﾞ			作成日付',13,10
		dc.b	'画像密度			色',13,10
		dc.b	'画像精度			表示位置',13,10
		dc.b	'色間引率			表示倍率',13,10
		dc.b	'状態                 ',13,10,0
.xdef	spc8_msg
spc8_msg	dc.b	'        ',0

ParamMsg
  dc.b '離散余弦変換による画像圧縮	v1.00  1993.02.07 by 砥波盛里',$0D,$0A
  dc.b '				v1.26  1996.11.10 by 藤原尚伸',$0D,$0A
  dc.b $0D,$0A
  dc.b '使用方法:JPEGED [Option]  Filename',$0D,$0A
  dc.b $0D,$0A
  dc.b '  -?		使用方法の表示',$0D,$0A
  dc.b '  -L[x1,y1,[x2,y2]]	ﾛｰﾄﾞ(JPEG展開)',$0D,$0A
  dc.b '  -S[x1,y1,[x2,y2]]	ｾｰﾌﾞ(JPEG圧縮)',$0D,$0A
  dc.b '  -VSx,y,$address	ﾒﾓﾘ上の仮想画面(16bitｶﾗｰ)を対象にJPEG圧縮・展開',$0D,$0A
*  dc.b '  -VFx,y,$address	ﾒﾓﾘ上の仮想画面(24bitｶﾗｰ)を対象にJPEG圧縮',$0D,$0A
  dc.b '  -VSx,y,fname		ﾌｧｲﾙ上の仮想画面(16bitｶﾗｰ)を対象にJPEG圧縮・展開',$0D,$0A
*  dc.b '  -VFx,y,fname		ﾌｧｲﾙ上の仮想画面(24bitｶﾗｰ)を対象にJPEG圧縮',$0D,$0A
  dc.b '  -H		ﾍｯﾀﾞ情報のみ出力',$0D,$0A
  dc.b '  -2		2ﾊﾟｽで圧縮',$0D,$0A
  dc.b '  -Mn		変換ﾓｰﾄﾞ（離散ｺｻｲﾝ）',$0D,$0A
  dc.b '		n=0  U,Vﾃﾞｰﾀを無くす(ﾓﾉｸﾛ画像にする)',$0D,$0A
  dc.b '		  1  8*8 pixel を3個の Y,U,V ﾌﾞﾛｯｸに分解して処理する。',$0D,$0A
  dc.b '		  2  U,Vﾃﾞｰﾀ(色差信号)を 1/2 に間引く。',$0D,$0A
  dc.b '		  3  U,Vﾃﾞｰﾀを 1/4 に間引く。(ﾃﾞﾌｫﾙﾄ)',$0D,$0A
  dc.b '  -Cfname	ｺﾒﾝﾄﾌｧｲﾙの指定',$0D,$0A
  dc.b '  -C"comment"	ｺﾒﾝﾄの指定',$0D,$0A
  dc.b '  -Qfname	量子化ﾃｰﾌﾞﾙの指定',$0D,$0A
  dc.b '  -Qn		量子化ﾚﾍﾞﾙ(ﾃﾞﾌｫﾙﾄ=1)',$0D,$0A
  dc.b '		小さい程圧縮率が高くなる',$0D,$0A
  dc.b '  -N		画像をｸﾘｱしない。',$0D,$0A
  dc.b '  -A		ｱｽﾍﾟｸﾄの変更(正方形)',$0D,$0A
  dc.b '  -Axd,yd	ﾋﾟｸｾﾙ密度の指定(ﾃﾞﾌｫﾙﾄは 3,2)',$0D,$0A
  dc.b '  -Bx1,y1	画像ﾌｧｲﾙ上の表示開始位置(ﾃﾞﾌｫﾙﾄは 0,0)',$0D,$0A
  dc.b '  -Inx/mx[,ny/my]	間引間隔(ﾃﾞﾌｫﾙﾄは 1/1,1/1)',$0D,$0A
  dc.b '  -Fn		表示ﾓｰﾄﾞ',13,10
  dc.b '		n=0  画面内に収まらない場合はｽｸﾛｰﾙして表示(ﾃﾞﾌｫﾙﾄ)',13,10
  dc.b '		  1  画像表示範囲全体に引き延ばして表示',13,10
  dc.b '		  2  画像表示範囲に収まるように出来るだけ大きく表示',13,10
  dc.b '		  3  画像表示範囲に収まるように表示(画像の持つｱｽﾍﾟｸﾄのまま表示)',13,10
  dc.b '  -Kn   	画像表示後、ｷｰ入力待ち制御(ﾃﾞﾌｫﾙﾄ=0)',13,10
  dc.b '		n=+1 ｷｰ入力待ちをする',13,10
  dc.b '		  +2 ｵｰﾄｽｸﾛｰﾙする',13,10
  dc.b '		  +4 TV Ctrlｷｰもｽｸﾛｰﾙ高速化ｷｰとして強制使用する',13,10
  dc.b '		  nの指定が無い場合は、n=+1+2=3が指定されたことになる',13,10
  dc.b '  -Wpath	ﾒﾓﾘが足りない場合、ﾃﾞｨｽｸに展開する',13,10
  dc.b '		path指定が無い場合は環境変数tempを参照する',13,10
  dc.b '  -Jn		画像自動補正(ﾃﾞﾌｫﾙﾄ=2)',13,10
  dc.b '		n=+1 ﾍｯﾀﾞ情報のｱｽﾍﾟｸﾄ情報に誤りがある画像の補正(3:2に設定)を行わない',13,10
  dc.b '		  +2 終了時の画像のHome位置補正を行う',13,10
  dc.b '		  nの指定が無い場合は、n=+1+2=3が指定されたことになる',13,10
  dc.b  0

.align 4
running_size

	.end
